amore55/m5Dash/sdkconfig.defaults
# Tab5 Desk Dashboard — project defaults.
#
# Anything in here can be overridden per-developer in `sdkconfig` (git-ignored) via
# `idf.py menuconfig`. Keep this file authoritative: CI builds from a clean tree and
# therefore builds exactly this configuration.
#
# Sources for the non-obvious values:
#   * PSRAM / cache / flash        M5Tab5-UserDemo platforms/tab5/sdkconfig.defaults
#   * esp_hosted SDIO pin map      M5Tab5-UserDemo platforms/tab5/sdkconfig  (verified)
#   * BSP display options          espressif/esp-bsp bsp/m5stack_tab5/Kconfig

CONFIG_IDF_TARGET="esp32p4"

# ---------------------------------------------------------------------------------------
# Flash and partitions
# ---------------------------------------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ---------------------------------------------------------------------------------------
# PSRAM (32 MB) — required: LVGL buffers, TLS buffers and the JSON scratch all live here.
# CONFIG_SPIRAM_XIP_FROM_PSRAM needs IDF_EXPERIMENTAL_FEATURES on IDF 5.4.
# ---------------------------------------------------------------------------------------
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y

# ---------------------------------------------------------------------------------------
# DELIBERATELY NOT SET — these were copied from M5Tab5-UserDemo and are believed to be why
# the panel initially came up blank. Do not re-add without re-testing the display.
#
#   CONFIG_CACHE_L2_CACHE_LINE_128B
#       On the ESP32-P4 internal RAM sits behind the L2 cache, so LCD DMA buffers need cache
#       maintenance, and esp_cache_msync() requires the buffer to be aligned to the cache
#       LINE size. Raising the line from the default 64 B to 128 B doubles that requirement,
#       and esp_lvgl_port allocates its draw buffers with an unaligned heap_caps_malloc().
#       M5Stack get away with it because their demo uses a different rendering path.
#
#   CONFIG_CACHE_L2_CACHE_256KB
#       Harmless in itself, but changed together with the line size, so it is left at the
#       default until the display is proven stable.
#
#   CONFIG_SPIRAM_XIP_FROM_PSRAM
#       Executes .text/.rodata from PSRAM. Espressif's own reference configuration for this
#       board does not enable it, and it competes with the display for PSRAM bandwidth.
#
# Espressif's known-good reference for this board is
# esp-bsp/examples/display/sdkconfig.bsp.m5stack_tab5 — worth diffing against before
# blaming application code for a display problem.
# ---------------------------------------------------------------------------------------

# ---------------------------------------------------------------------------------------
# CPU / compiler
# ---------------------------------------------------------------------------------------
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n

# ---------------------------------------------------------------------------------------
# FreeRTOS / watchdog
#
# The task watchdog is left ON with a generous timeout. Every long-running task in this
# project either blocks on a queue/semaphore with a timeout or calls vTaskDelay, so it
# should never trip; if it does, that is a real bug and we want the reboot.
# ---------------------------------------------------------------------------------------
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=15
CONFIG_ESP_INT_WDT=y

# PANIC on a task-watchdog timeout rather than just printing a warning and carrying on.
#
# A hang that silently resets the device is close to undiagnosable; a hang that panics writes a
# backtrace to the console AND a core dump to flash, which `idf.py coredump-info` turns into the
# exact task and line. Trading a "recoverable" warning for a diagnosable crash is the right call
# on a device that is meant to run unattended for weeks — a task that stopped yielding is not
# actually recoverable, it is just failing quietly.
CONFIG_ESP_TASK_WDT_PANIC=y

# ---------------------------------------------------------------------------------------
# Bootloader / OTA / rollback
#
# APP_ROLLBACK_ENABLE makes the bootloader boot a freshly-written image in PENDING_VERIFY.
# If the app does not call esp_ota_mark_app_valid_cancel_rollback() the next reset falls
# back to the previous slot. AppController does that only after start-up checks pass.
# ---------------------------------------------------------------------------------------
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_WDT_ENABLE=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
# Anti-rollback (efuse-based downgrade prevention) is deliberately OFF: it burns an efuse and
# is irreversible, which would make development flashing a one-way door.
CONFIG_BOOTLOADER_APP_ANTI_ROLLBACK=n

# ---------------------------------------------------------------------------------------
# Core dump to flash — so a crash after an OTA can be read back over USB.
# ---------------------------------------------------------------------------------------
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_SHA256=y

# ---------------------------------------------------------------------------------------
# TLS. Certificate validation is ON and stays on.
#
# The full bundle is used because we talk to five unrelated hosts (open-meteo.com,
# api.tfl.gov.uk, api.telegram.org, objects.githubusercontent.com, api.claude.ai) whose
# roots are not all in the "common" subset. ASYMMETRIC_CONTENT_LEN keeps the 16 KB inbound
# record buffer without paying for a 16 KB outbound one.
# ---------------------------------------------------------------------------------------
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
CONFIG_MBEDTLS_HARDWARE_SHA=y
CONFIG_MBEDTLS_HARDWARE_AES=y

# mbedTLS allocates from PSRAM, not internal SRAM. NOT optional on this board.
#
# The default (CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC) puts the 16 KB TLS input buffer, the output
# buffer and the whole certificate-chain parse into internal SRAM. There is ~500 KB of that in
# total on the ESP32-P4, and the display, LVGL and the esp_hosted SDIO driver have already taken
# most of it by the time a plugin fetches anything.
#
# Observed with the default, on the first HTTPS request the weather page made after boot:
#     E esp-aes: Failed to allocate memory for start alignment buffer
#     E esp-sha: Failed to allocate buf memory
#     E dma_utils: esp_dma_capable_malloc(181): Not enough heap memory
#     assert failed: sdio_rx_get_buffer sdio_drv.c:670 (*buf)
# — i.e. the TLS handshake exhausted internal RAM, then the Wi-Fi transport could not get a
# DMA buffer and asserted, panicking the device into a reboot loop. The total-free-heap figure
# stayed at 31 MB throughout, which is why the health report now prints internal and DMA
# separately: the number that matters was never on screen.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# Wi-Fi and lwIP buffers from PSRAM too, for the same reason and with a measured effect: with two
# plugins fetching, this raised the internal low-water mark from 23.4 KB to 28.2 KB. Note that it
# is TRY_ALLOCATE — anything that genuinely needs DMA-capable internal memory still gets it.
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Frees each TLS session's internal-only working buffers (the parts EXTERNAL_MEM_ALLOC above does
# not cover — those are still internal-SRAM by construction) as soon as the handshake completes,
# instead of holding them for the life of the connection. Turned on after adding OTA, then
# Telegram/tasks pushed the boot-time burst of sequential plugin fetches back into the exact
# §1.3 failure — esp_dma_capable_malloc failing inside esp_hosted's SDIO driver, unrelated to
# whichever plugin actually spent the memory — with more permanent worker-stack baseline cost
# than the ~65 KB this budget was originally measured against.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y

# Doubled (ESP-IDF's own default is 32768) after §1.3 was root-caused, on 31 August, to
# FRAGMENTATION rather than exhaustion: heap_caps_get_largest_free_block(MALLOC_CAP_DMA) was
# measured stuck at ~3 KB while ~12 KB was nominally free, because hardware SHA/AES has to make a
# temporary internal+DMA copy of every PSRAM-resident TLS buffer it touches (all of them, since
# MBEDTLS_EXTERNAL_MEM_ALLOC above routes mbedTLS's own allocations to PSRAM unconditionally) —
# hundreds of small, all correctly freed, allocations per handshake, churning inside a pool this
# small. Per this option's own Kconfig help, that pool is not a separate arena: it is memory nothing
# else may take from normal malloc(), and FreeRTOS task stacks (forced internal regardless) draw
# from it too — so growing it protects more internal SRAM for things that must have it, at the
# cost of things that merely default there under SPIRAM_MALLOC_ALWAYSINTERNAL. Measured on device
# on 12 September: the largest-free-block floor rose from crashing in the 1.5–8 KB range to a
# stable 14–22 KB across many consecutive cold boots, a multi-minute continuous run, and a live
# OTA manifest check (previously one of the most reliable ways to reproduce the crash, since it
# contacts hosts nothing else warms).
#
# Raised again, 65536 -> 98304, on 13 September, after the first real OTA INSTALL this project
# ever completed past the manifest fetch hit a different, genuine exhaustion (not fragmentation):
# `esp_dma_capable_malloc(): Not enough heap memory` followed by `assert failed:
# sdio_rx_get_buffer` — the ESP32-C6 Wi-Fi co-processor's own SDIO receive path failing to get a
# DMA-capable buffer for an incoming packet, crashing Core 0 directly (not the OTA task's stack —
# a different failure from the same day's other OTA crash).
#
# 98304 was NOT enough. Once other plugins' own background polling was also confirmed and fixed
# as a contributing factor (net::largeTransferInProgress(), same day), a direct measurement of
# heap_caps_get_free_size/largest_free_block(MALLOC_CAP_DMA) taken every 128 KB through a real
# download (OtaService's own temporary diagnostic logging) showed the pool already down to
# free=5695 largest=2432 bytes at just 128 KB into a 2 MB image — genuine fragmentation, the same
# §1.3 mechanism, but worse under a long SUSTAINED receive than any earlier measurement exercised
# (every prior figure here was validated against brief, individual handshakes, never a multi-
# second continuous stream). Raised again, 98304 -> 163840, a much larger jump than the previous
# doublings, specifically to be re-measured with the SAME per-128KB diagnostic across a WHOLE
# download rather than assumed sufficient from a boot-time or single-fetch test. Do not trust this
# figure until that full-download measurement exists — see docs/BACKLOG.md.
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=163840

