amore55/m5Dash/sdkconfig.defaults
# ---------------------------------------------------------------------------------------
# HTTP client / server
# ---------------------------------------------------------------------------------------
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_ESP_TLS_INSECURE=n
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=n

# ---------------------------------------------------------------------------------------
# lwIP / SNTP
# ---------------------------------------------------------------------------------------
CONFIG_LWIP_LOCAL_HOSTNAME="desk-dashboard"
CONFIG_LWIP_SNTP_MAX_SERVERS=2
CONFIG_LWIP_DHCP_GET_NTP_SRV=n
CONFIG_LWIP_SO_RCVBUF=y

# ---------------------------------------------------------------------------------------
# Wi-Fi via the ESP32-C6 coprocessor (esp_wifi_remote over esp_hosted / SDIO).
#
# THESE PINS ARE THE TAB5's — copied from M5Stack's own committed sdkconfig for this board.
# Do not "tidy" them. See docs/IMPLEMENTATION_PLAN.md §5.
#
# bsp_feature_enable(BSP_FEATURE_WIFI, true) must be called before esp_wifi_init(); the
# board's second IO expander gates power to the C6. tab5_board::Board::enableWifiRail()
# does this.
# ---------------------------------------------------------------------------------------
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_BUS_WIDTH=4
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=13
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=12
CONFIG_ESP_HOSTED_SDIO_PIN_D0=11
# D1 IS SPECIAL AND MUST BE SET VIA THE _PRIV_ SYMBOL.
#
# ESP_HOSTED_SDIO_PIN_D1 is declared in esp_hosted's Kconfig as a bare `int` with NO prompt —
# it is a derived symbol whose value comes from ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS (or the
# 1-bit equivalent). Setting CONFIG_ESP_HOSTED_SDIO_PIN_D1 here is therefore SILENTLY IGNORED,
# and D1 falls back to its ESP32-P4 default of 15 — which is also the slave reset pin.
#
# The result is a pin collision that presents as an SDIO enumeration failure and an abort inside
# hosted_sdio_card_fn_init(), i.e. a boot loop:
#
#   sdio_wrapper: GPIOs: CLK[12] CMD[13] D0[11] D1[15] D2[9] D3[8] Slave_Reset[15]
#   sdmmc_io: sdmmc_io_rw_extended: sdmmc_send_cmd returned 0xffffffff
#   sdio_wrapper: failed to get CIS data.
#
# Both keys are set: the _PRIV_ one because it is what actually takes effect, and the derived
# one for documentation and so a diff against M5Stack's configuration matches.
CONFIG_ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS=10
CONFIG_ESP_HOSTED_SDIO_PIN_D1=10
CONFIG_ESP_HOSTED_SDIO_PIN_D2=9
CONFIG_ESP_HOSTED_SDIO_PIN_D3=8
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=15
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_LOW=y
# Switched from RX_STREAMING_MODE (the component's own default) to RX_MAX_SIZE on 13 September,
# chasing the DMA-pool crash logged just above (§1.3, and its own OTA-download entries): reading
# esp_hosted's own host/drivers/transport/sdio/sdio_drv.c showed that streaming mode's
# sdio_rx_get_buffer() allocates its receive buffer with a raw, VARIABLE-sized MEM_ALLOC/free —
# growing (never shrinking) whenever an incoming chunk needs more room than the last one, freeing
# the old buffer first — exactly the alloc-different-sizes-and-free churn pattern that fragments a
# DMA-capable pool. RX_MAX_SIZE instead always reads a fixed 512*3-byte block, at the cost of one
# extra SDIO transaction per read (asking the slave for the exact size first) — this trades a
# little Wi-Fi throughput for buffers that never need to grow or be freed-and-reallocated. Not yet
# proven sufficient by an actual completed OTA install — see docs/BACKLOG.md.
CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_MAX_SIZE=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y

# ---------------------------------------------------------------------------------------
# Screen rotation via the ESP32-P4's Pixel Processing Accelerator.
#
# The panel is physically 720x1280 portrait; the UI is 1280x720 landscape. Without this,
# esp_lvgl_port rotates every flushed area on the CPU with lv_draw_sw_rotate(), which on a
# 921,600-pixel display is a lot of work to do in software when the SoC has dedicated
# hardware for exactly this.
#
# It also allocates its buffer with heap_caps_aligned_calloc() at the cache line size
# (lcd_ppa.c:59), whereas the software path uses a plain heap_caps_malloc() — which matters
# because the buffers live in PSRAM and are cache-synced.
#
# Requires SOC_PPA_SUPPORTED, which is 1 on the ESP32-P4. Defaults to n upstream.
# ---------------------------------------------------------------------------------------
# TEMPORARILY OFF while the display is being brought up: Espressif's reference config for this
# board does not enable it, and the goal right now is to match a known-good configuration
# exactly. Re-enable once a picture is confirmed — it is genuinely worth having, since it moves
# rotation off the CPU onto dedicated hardware.
CONFIG_LVGL_PORT_ENABLE_PPA=n

# ---------------------------------------------------------------------------------------
# M5Stack Tab5 BSP
#
# NOTE: tab5_board::Board::init() passes an explicit bsp_display_cfg_t and therefore does not
# use CONFIG_BSP_LCD_DRAW_BUF_HEIGHT. It is kept in step with the value in board.cpp so the
# two do not tell different stories.
#
# Draw buffers are 720 x 120 px x 2 B = 173 KB each, in DMA-capable PSRAM (not internal RAM).
# See the long comment in board.cpp: rotation needs a third buffer of the same size, and
# three of these do not fit in the ~243 KB largest internal block.
# ---------------------------------------------------------------------------------------
CONFIG_BSP_ERROR_CHECK=y
CONFIG_BSP_I2C_NUM=1
CONFIG_BSP_LCD_DRAW_BUF_HEIGHT=40
CONFIG_BSP_LCD_DRAW_BUF_DOUBLE=y
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=1
CONFIG_BSP_LCD_USE_DMA2D=y
CONFIG_BSP_DISPLAY_BRIGHTNESS_LEDC_CH=1
CONFIG_BSP_DISPLAY_LVGL_AVOID_TEAR=n
CONFIG_BSP_SD_MOUNT_POINT="/sdcard"
CONFIG_BSP_SD_FORMAT_ON_MOUNT_FAIL=n

