amore55/m5Dash/sdkconfig.defaults
# ---------------------------------------------------------------------------------------
# LVGL 9
#
# CLIB malloc/string/sprintf: PSRAM-backed heap via the IDF allocator instead of LVGL's
# own fixed pool, so a large label or a task list cannot exhaust a private arena.
# Only the font sizes the theme actually uses are enabled, to keep the binary small.
# ---------------------------------------------------------------------------------------
CONFIG_LV_COLOR_DEPTH_16=y
# Custom malloc: LVGL allocates from PSRAM via components/dashboard_core/src/lvgl_heap.c.
# NOT CLIB malloc — SPIRAM_MALLOC_ALWAYSINTERNAL=16384 puts every sub-16KB malloc in
# internal SRAM, which measured at 47.5 KB of internal RAM for six resident pages.
CONFIG_LV_USE_CUSTOM_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=25
CONFIG_LV_DRAW_BUF_ALIGN=64
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_USE_MEM_MONITOR=n
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_WARN=y
CONFIG_LV_LOG_PRINTF=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_FONT_COMPRESSED=n
CONFIG_LV_USE_KEYBOARD=y
CONFIG_LV_USE_TEXTAREA=y
CONFIG_LV_USE_MSGBOX=y
CONFIG_LV_USE_SWITCH=y
CONFIG_LV_USE_SLIDER=y
CONFIG_LV_USE_ROLLER=y
CONFIG_LV_USE_LIST=y
CONFIG_LV_USE_BAR=y
CONFIG_LV_USE_SPINNER=y
CONFIG_LV_USE_ARC=y

# ---------------------------------------------------------------------------------------
# LittleFS (tasks + API response cache)
# ---------------------------------------------------------------------------------------
CONFIG_LITTLEFS_MAX_PARTITIONS=1
CONFIG_LITTLEFS_PAGE_SIZE=256
CONFIG_LITTLEFS_OBJ_NAME_LEN=64
CONFIG_LITTLEFS_FCNTL_GET_PATH=n

# ---------------------------------------------------------------------------------------
# Logging. INFO by default; the network and secret-bearing modules downgrade their own
# verbose output at compile time (see dashboard/log.hpp).
# ---------------------------------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_LOG_COLORS=y
